# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?
print("Введите количество буамжных журавликов")
numbersJuravli=int(input())
productionPetya=numbersJuravli/6
productionKatya=numbersJuravli*4/6
productionSereja=numbersJuravli/6
print("Петя сделал следующее число журавлей:",int(productionPetya))
print("Катя сделала следующее число журавлей:",int(productionKatya))
print("Сережа сделал следующее число журавлей:",int(productionSereja))